{
  "_name_or_path": "/Users/alexanderjbrooks/.cache/huggingface/hub/models--hf-internal-testing--tiny-stable-diffusion-xl-pipe/snapshots/fa06b5c3d6d45fabd978486616c6dae068519e85/text_encoder_2",
  "architectures": ["CLIPTextModelWithProjection"],
  "attention_dropout": 0.0,
  "bos_token_id": 0,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_size": 32,
  "initializer_factor": 1.0,
  "initializer_range": 0.02,
  "intermediate_size": 37,
  "layer_norm_eps": 1e-5,
  "max_position_embeddings": 77,
  "model_type": "clip_text_model",
  "num_attention_heads": 4,
  "num_hidden_layers": 5,
  "pad_token_id": 1,
  "projection_dim": 32,
  "torch_dtype": "float32",
  "transformers_version": "4.31.0",
  "vocab_size": 1000
}
