{
  "architectures": [
    "YolosForObjectDetection"
  ],
  "attention_probs_dropout_prob": 0.1,
  "auxiliary_loss": false,
  "bbox_cost": 5,
  "bbox_loss_coefficient": 5,
  "class_cost": 1,
  "eos_coefficient": 0.1,
  "giou_cost": 2,
  "giou_loss_coefficient": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 32,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1",
    "2": "LABEL_2"
  },
  "image_size": [
    30,
    30
  ],
  "initializer_range": 0.02,
  "intermediate_size": 37,
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1,
    "LABEL_2": 2
  },
  "layer_norm_eps": 1e-12,
  "model_type": "yolos",
  "num_attention_heads": 4,
  "num_channels": 3,
  "num_detection_tokens": 10,
  "num_hidden_layers": 5,
  "patch_size": 2,
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.27.1",
  "use_mid_position_embeddings": true
}
